# lab-sql-python-connection

1. Establish a connection between Python and the Sakila database.

In [101]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine
import getpass

In [2]:
password = getpass.getpass()

········

In [102]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)
#check
data = pd.read_sql_query('SELECT * FROM actor', engine)
data.head(2)

   actor_id first_name last_name         last_update
0         1   PENELOPE   GUINESS 2006-02-15 04:34:33
1         2       NICK  WAHLBERG 2006-02-15 04:34:33

2. Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

・engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.

・month: an integer representing the month for which rental data is to be retrieved.

・year: an integer representing the year for which rental data is to be retrieved.

In [103]:
def rentals_month(engine: object , month: int, year: int) -> pd.DataFrame:
    '''
    This function retrieves the data specified a month and a year from sakila.rental.
    
    Input: 
    engine -> object  
    month -> int
    year -> int
    
    Output: pd.DataFrame
    
    '''
    
    query = f"""
    SELECT *
    FROM rental
    WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year};
    """
    
    data = pd.read_sql_query(query, engine)
    if data.empty:
        print(f'There is no data in {month} /{year}.')
    return data

In [104]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)


#check
display(rentals_month(engine,6,2005))

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
2306,3465,2005-06-21 22:10:01,1488,510,2005-06-30 21:35:01,1,2006-02-15 21:30:53
2307,3466,2005-06-21 22:13:33,371,226,2005-06-25 21:01:33,2,2006-02-15 21:30:53
2308,3467,2005-06-21 22:19:25,729,543,2005-06-27 00:03:25,2,2006-02-15 21:30:53
2309,3468,2005-06-21 22:43:45,2899,100,2005-06-30 01:49:45,1,2006-02-15 21:30:53
2310,3469,2005-06-21 22:48:59,4087,181,2005-06-28 19:32:59,1,2006-02-15 21:30:53

In [105]:
#check (null values)
rentals_month(engine,6,2023)

There is no data in 6 /2023.

Empty DataFrame
Columns: [rental_id, rental_date, inventory_id, customer_id, return_date, staff_id, last_update]
Index: []

3. Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

In [119]:
def rental_count_month(df:pd.DataFrame)-> pd.DataFrame:
    """
    This function takes the DataFrame provided by rentals_months and returns a new DataFrame
    cantaining the number of rentals made by each customoer_id.
    
    Input: pd.DataFrame
    OutPut:pd.DataFrame
    
    """
    if df.empty:
        return 'There is no data. Check again!'
    
    df2 = df.copy()
    
    #retrieve a year and a month
    year = df2.iloc[0,1].year
    month = df2.iloc[0,1].strftime('%m')
    
    new_column = f"rentals_{month}_{year}"
    
    #the number of rentals made by each customer_id 
    df3 = df2.groupby('customer_id').size().reset_index(name=new_column)
    
    
    return df3

In [120]:
#check
df1 = rentals_month(engine,5,2005)  

rental_count_month(df1).head()

   customer_id  rentals_05_2005
0            1                2
1            2                1
2            3                2
3            5                3
4            6                3

In [121]:
#check
df2 = rentals_month(engine,6,2005)  

rental_count_month(df2).head()

   customer_id  rentals_06_2005
0            1                7
1            2                1
2            3                4
3            4                6
4            5                5

In [122]:
#check(null values)
df_null = rentals_month(engine,6,2023)
rental_count_month(df_null)

There is no data in 6 /2023.

'There is no data. Check again!'

4. Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [143]:
def compare_rentals(df1:pd.DataFrame, df2:pd.DataFrame)->pd.DataFrame:
    """
    This function comapre two  two DataFrames containing the number of rentals made by each customer 
    in different months and years, and return a combined DataFrame with a new 'difference' column.
    
    Input:
    df1 -> pd.DataFrame
    df2 -> pd.DataFrame
    
    Output: pd.DataFrame
    """
    
    
    df3 = df1.copy()
    df4 = df2.copy()
    
    #combine
    merged_df = pd.merge(df3,df4, on='customer_id')
    
    #create a new column of 'difference'
    merged_df['difference'] = abs(merged_df.iloc[:,1] - merged_df.iloc[:,2])
    
    return merged_df

In [144]:
#check
df1 = rentals_month(engine,5,2005)  
df3= rental_count_month(df1)

df2 = rentals_month(engine,6,2005)  
df4 = rental_count_month(df2)

compare_rentals(df3,df4)

     customer_id  rentals_05_2005  rentals_06_2005  difference
0              1                2                7           5
1              2                1                1           0
2              3                2                4           2
3              5                3                5           2
4              6                3                4           1
..           ...              ...              ...         ...
507          594                4                6           2
508          595                1                2           1
509          596                6                2           4
510          597                2                3           1
511          599                1                4           3

[512 rows x 4 columns]